app/controllers/school_classes_controller.rb

      def create
        @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sss"], ["room_number", 0], ["created_at", "2020-03-16 19:26:31.086583"], ["updated_at", "2020-03-16 19:26:31.086583"]]