app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "happy"], ["last_name", "happy"], ["created_at", "2020-03-16 01:25:28.847734"], ["updated_at", "2020-03-16 01:25:28.847734"]]
---
    def create
        @student = Student.new
        @student.first_name = params[:student][:first_name]
        @student.last_name = params[:student][:last_name]
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2020-03-16 01:14:01.825481"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.first_name = params[:student][:first_name]
        @student.last_name = params[:student][:last_name]
        @student.save